frameworks/rails/app/controllers/todos_controller.rb

  def index
    render json: Todo.all.order(:id)
---
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" ASC

  def create
    todo = Todo.create!(title: params[:title], done: params[:done] || false)
---
INSERT INTO "todos" ("title", "done") VALUES ($1, $2) RETURNING "id"  [["title", "Test Rails"], ["done", false]]